tutorials/buoyantFoam/hotRoom/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name from directory
parentDir=`dirname $PWD`
application=`basename $parentDir`

compileApplication setHotRoom
runApplication blockMesh
runApplication setHotRoom
runApplication $application
