tutorials/buoyantFoam/hotRoom/constant/turbulenceProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          turbulenceProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

turbulenceModel kEpsilon;

turbulence      on;

laminarCoeffs
{
}

kEpsilonCoeffs
{
    Cmu             Cmu [0 0 0 0 0 0 0] 0.09;
    C1              C1 [0 0 0 0 0 0 0] 1.44;
    C2              C2 [0 0 0 0 0 0 0] 1.92;
    C3              C3 [0 0 0 0 0 0 0] 0.85;
    alphah          alphah [0 0 0 0 0 0 0] 1;
    alphak          alphak [0 0 0 0 0 0 0] 1;
    alphaEps        alphaEps [0 0 0 0 0 0 0] 0.76923;
}

RNGkEpsilonCoeffs
{
    Cmu             Cmu [0 0 0 0 0 0 0] 0.0845;
    C1              C1 [0 0 0 0 0 0 0] 1.42;
    C2              C2 [0 0 0 0 0 0 0] 1.68;
    C3              C3 [0 0 0 0 0 0 0] -0.33;
    alphah          alphah [0 0 0 0 0 0 0] 1;
    alphak          alphaK [0 0 0 0 0 0 0] 1.39;
    alphaEps        alphaEps [0 0 0 0 0 0 0] 1.39;
    eta0            eta0 [0 0 0 0 0 0 0] 4.38;
    beta            beta [0 0 0 0 0 0 0] 0.012;
}

LaunderSharmaKECoeffs
{
    Cmu             Cmu [0 0 0 0 0 0 0] 0.09;
    C1              C1 [0 0 0 0 0 0 0] 1.44;
    C2              C2 [0 0 0 0 0 0 0] 1.92;
    C3              C3 [0 0 0 0 0 0 0] -0.33;
    alphah          alphah [0 0 0 0 0 0 0] 1;
    alphak          alphak [0 0 0 0 0 0 0] 1;
    alphaEps        alphaEps [0 0 0 0 0 0 0] 0.76923;
}

LRRCoeffs
{
    Cmu             Cmu [0 0 0 0 0 0 0] 0.09;
    Clrr1           Clrr1 [0 0 0 0 0 0 0] 1.8;
    Clrr2           Clrr2 [0 0 0 0 0 0 0] 0.6;
    C1              C1 [0 0 0 0 0 0 0] 1.44;
    C2              C2 [0 0 0 0 0 0 0] 1.92;
    alphah          alphah [0 0 0 0 0 0 0] 1;
    Cs              Cs [0 0 0 0 0 0 0] 0.25;
    Ceps            Ceps [0 0 0 0 0 0 0] 0.15;
    alphaR          alphaR [0 0 0 0 0 0 0] 1;
    alphaEps        alphaEps [0 0 0 0 0 0 0] 0.76923;
}

LaunderGibsonRSTMCoeffs
{
    Cmu             Cmu [0 0 0 0 0 0 0] 0.09;
    Clg1            Clg1 [0 0 0 0 0 0 0] 1.8;
    Clg2            Clg2 [0 0 0 0 0 0 0] 0.6;
    C1              C1 [0 0 0 0 0 0 0] 1.44;
    C2              C2 [0 0 0 0 0 0 0] 1.92;
    alphah          alphah [0 0 0 0 0 0 0] 1;
    C1Ref           C1Ref [0 0 0 0 0 0 0] 0.5;
    C2Ref           C2Ref [0 0 0 0 0 0 0] 0.3;
    Cs              Cs [0 0 0 0 0 0 0] 0.25;
    Ceps            Ceps [0 0 0 0 0 0 0] 0.15;
    alphaR          alphaR [0 0 0 0 0 0 0] 1;
    alphaEps        alphaEps [0 0 0 0 0 0 0] 0.76923;
}

wallFunctionCoeffs
{
    kappa           kappa [0 0 0 0 0 0 0] 0.4187;
    E               E [0 0 0 0 0 0 0] 9;
}


// ************************************************************************* //
